app/Services/InterclubService.php

    public function createInterclub(array $validated): void
    {
        // Instanciating elements
        $clubTeam = Team::find($validated['team_id']);
        $season = Season::find($clubTeam->season->id);
        $league = League::find($clubTeam->league->id);
        $oppositeClub = Club::find($validated['opposite_club_id']);

        // Deal with other club's team
        $oppositeTeam = Team::firstorCreate([
            'name' => $validated['opposite_team_name'],
            'club_id' => $oppositeClub->id,
            'season_id' => $season->id,
            'league_id' => $league->id,
        ]);
---
select * from `teams` where `teams`.`id` = '1' limit 1
select * from `seasons` where `seasons`.`id` = 1 limit 1
select * from `leagues` where `leagues`.`id` = 1 limit 1
select * from `clubs` where `clubs`.`id` = '2' limit 1
insert into `teams` (`name`, `club_id`, `season_id`, `league_id`, `updated_at`, `created_at`) values ('F', 2, 1, 1, '2024-09-03 21:12:56', '2024-09-03 21:12:56')
select * from `teams` where (`name` = 'F' and `club_id` = 2 and `season_id` = 1 and `league_id` = 1) limit 1

            $interclub->visitingTeam()->associate($clubTeam);
        }

        $interclub
            ->fill($validated)
            ->setTotalPlayersPerteam($league->category)
            ->setWeekNumber($validated['start_date_time'])
            ->save();
---
insert into `interclubs` (`visited_team_id`, `visiting_team_id`, `start_date_time`, `address`, `total_players`, `week_number`, `updated_at`, `created_at`) values (3, 1, '2024-09-13 19:45:00', 'Avenue du Comté de Jette, 3, 1090 Jette', 4, 37, '2024-09-03 21:12:56', '2024-09-03 21:12:56')