routes/web.php

/**
 * Dashboard with sample of most data
 */
Route::get('/admin/dashboard', function () {
    return view('admin.dashboard', [
        'users' => User::latest()->take(5)->get(),
        'users_total_active' => User::where('is_active', '=', true)->count(),
        'users_total_inactive' => User::where('is_active', '=', false)->count(),
        'users_total_competitors' => User::where('is_competitor', '=', true)->count(),
        'users_total_casuals' => User::where('is_competitor', '=', false)->count(),
        'rooms' => Room::orderby('name')->get(),
        'trainings' => Training::latest()->take(5)->get(),
        'teams' => Team::all()->load(['captain', 'users']),
        'breadcrumbs' => [
            ['title' => 'Home', 'url' => route('dashboard'), 'icon' => 'home'],
            ['title' => 'Dashboard', 'url' => route('dashboard'), 'icon' => 'home']
        ],
    ]);
})->middleware(['auth', 'verified'])
    ->name('dashboard');
---
select count(*) as aggregate from `users` where `is_competitor` = 0
select * from `rooms` order by `name` asc
select `users`.*, `team_user`.`team_id` as `pivot_team_id`, `team_user`.`user_id` as `pivot_user_id` from `users` inner join `team_user` on `users`.`id` = `team_user`.`user_id` where `team_user`.`team_id` in (1, 2, 3)