app/Http/Controllers/InterclubController.php

select * from `interclubs` order by `start_date_time` asc limit 10 offset 0
select count(*) as aggregate from `interclubs`
---
    public function index()
    {
        //
        $interclubs = Interclub::orderBy('start_date_time', 'asc')->paginate(10);

select * from `clubs` where `licence` = 'BBW214' limit 1
select * from `clubs` where not `licence` = 'BBW214' order by `name` asc
---
    public function create()
    {
        //
        $this->authorize('create', Interclub::class);
        $club = Club::firstWhere('licence', config('app.club_licence'));
        $otherClubs = Club::where('licence', '!=', config('app.club_licence'))->orderBy('name')->get();