app/Http/Controllers/InterclubController.php

    public function create()
    {
        //
        $this->authorize('create', Interclub::class);
        $club = Club::OurClub()->first();
        $otherClubs = Club::OtherClubs()->orderBy('name')->get();
        $user = Auth::user();
        $teams = ($user->is_admin || $user->is_committee_member)
            ? $teams = Team::where('club_id', $club->id)->get()
            : $teams = Team::where('captain_id', $user->id)->get();
        $rooms = Room::select('id', 'name')
            ->where('capacity_for_interclubs', '>', 0)
            ->get();
---
select * from `teams` where `club_id` = 1
select `id`, `name` from `rooms` where `capacity_for_interclubs` > 0

    public function show(Interclub $interclub): View
    {
        $this->authorize('view', Auth::user(), Interclub::class);

        $selectedUsers = $interclub
            ->users()
            ->wherePivot('is_selected', true)
            ->orderBy('last_name', 'asc')
            ->orderby('first_name', 'asc')
            ->get();

        $subscribedUsers = $interclub
            ->users()
            ->wherePivot('is_subscribed', true)
            ->wherePivot('is_selected', false)
            ->orWherePivot('is_selected', null)
            ->orderBy('last_name', 'asc')
            ->orderby('first_name', 'asc')
            ->get();
---
select `users`.*, `interclub_user`.`interclub_id` as `pivot_interclub_id`, `interclub_user`.`user_id` as `pivot_user_id`, `interclub_user`.`is_subscribed` as `pivot_is_subscribed`, `interclub_user`.`is_selected` as `pivot_is_selected`, `interclub_user`.`has_played` as `pivot_has_played`, `interclub_user`.`created_at` as `pivot_created_at`, `interclub_user`.`updated_at` as `pivot_updated_at` from `users` inner join `interclub_user` on `users`.`id` = `interclub_user`.`user_id` where `interclub_user`.`interclub_id` = 1 and `interclub_user`.`is_selected` = 1 order by `last_name` asc, `first_name` asc
select `users`.*, `interclub_user`.`interclub_id` as `pivot_interclub_id`, `interclub_user`.`user_id` as `pivot_user_id`, `interclub_user`.`is_subscribed` as `pivot_is_subscribed`, `interclub_user`.`is_selected` as `pivot_is_selected`, `interclub_user`.`has_played` as `pivot_has_played`, `interclub_user`.`created_at` as `pivot_created_at`, `interclub_user`.`updated_at` as `pivot_updated_at` from `users` inner join `interclub_user` on `users`.`id` = `interclub_user`.`user_id` where `interclub_user`.`interclub_id` = 1 and `interclub_user`.`is_subscribed` = 1 and `interclub_user`.`is_selected` = 0 or `interclub_user`.`is_selected` is null order by `last_name` asc, `first_name` asc

    public function toggleSelection(Interclub $interclub, User $user): RedirectResponse
    {
        $userWithPivot = $user->interclubs()->where('interclub_id', $interclub->id)->first();

        // if (!isset($userWithPivot->registration->is_selected)) {
        //     $userWithPivot->registration->is_selected = false;
        // }

        // Toggle pivot value
        $user->interclubs()->updateExistingPivot($interclub->id, [
            'is_selected' => ! $userWithPivot->registration->is_selected,
        ]);

        return ! $userWithPivot->registration->is_selected
            ? redirect()->route('interclubs.show', $interclub)->with('success', __($user->last_name . ' ' . $user->first_name . ' has been selected for the interclub.'))
            : redirect()->route('interclubs.show', $interclub)->with('deleted', __($user->last_name . ' ' . $user->first_name . ' has been unselected for the interclub.'));
---
select `interclubs`.*, `interclub_user`.`user_id` as `pivot_user_id`, `interclub_user`.`interclub_id` as `pivot_interclub_id`, `interclub_user`.`is_subscribed` as `pivot_is_subscribed`, `interclub_user`.`is_selected` as `pivot_is_selected`, `interclub_user`.`has_played` as `pivot_has_played`, `interclub_user`.`created_at` as `pivot_created_at`, `interclub_user`.`updated_at` as `pivot_updated_at` from `interclubs` inner join `interclub_user` on `interclubs`.`id` = `interclub_user`.`interclub_id` where `interclub_user`.`user_id` = 3 and `interclub_id` = 1 limit 1
select * from `interclubs`