app/Http/Controllers/PublicSiteController.php

    public function homePage()
    {
        $now = now();
        return view('/public/welcome', [
            'trainings' => Training::where('start', '>=', $now)->orderBy('start', 'asc')->take(5)->get(),
            'training_levels' => collect(TrainingLevel::cases()),
            'training_types' => collect(TrainingType::cases()),
        ]);
---
select * from `trainings` where `start` >= '2024-09-03 20:27:56' order by `start` asc limit 5